Tekla Open API Reference for Tekla Structures 2025
AnalysisBeamEnd Properties
The AnalysisBeamEnd type exposes the following members.
Properties
Name | Description
Connectivity
 Gets or sets the connectivity at the beam end.
Eccentricity
 Gets or sets the eccentricity at the beam end (in the member's local coordinate system).
Profile
 Gets or sets the profile at the beam end.
Top
See Also
Reference
AnalysisBeamEnd Class
Tekla.Structures.Analysis Namespace